#### Terraform Initialization ⚙️　`success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan Result</summary>

```terraform
   + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-northeast-1"
      + tags                                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "wordpress-bedrock-prod-public-ap-northeast-1a"
          + "Project"     = "wordpress-bedrock"
          + "Type"        = "Public"
        }
      + tags_all                                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "wordpress-bedrock-prod-public-ap-northeast-1a"
          + "Project"     = "wordpress-bedrock"
          + "Type"        = "Public"
        }
      + vpc_id                                         = "vpc-023c8aac08314c0b6"
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-northeast-1"
      + tags                                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "wordpress-bedrock-prod-public-ap-northeast-1c"
          + "Project"     = "wordpress-bedrock"
          + "Type"        = "Public"
        }
      + tags_all                                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "wordpress-bedrock-prod-public-ap-northeast-1c"
          + "Project"     = "wordpress-bedrock"
          + "Type"        = "Public"
        }
      + vpc_id                                         = "vpc-023c8aac08314c0b6"
    }

  # aws_vpc.main will be updated in-place
  ~ resource "aws_vpc" "main" {
        id                                   = "vpc-023c8aac08314c0b6"
      ~ tags                                 = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          ~ "Name"        = "wpsite-vpc" -> "wordpress-bedrock-prod-vpc"
          + "Project"     = "wordpress-bedrock"
        }
      ~ tags_all                             = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          ~ "Name"        = "wpsite-vpc" -> "wordpress-bedrock-prod-vpc"
          + "Project"     = "wordpress-bedrock"
        }
        # (19 unchanged attributes hidden)
    }

Plan: 20 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + database_route_table_ids = [
      + (known after apply),
      + (known after apply),
    ]
  + database_subnet_ids      = [
      + (known after apply),
      + (known after apply),
    ]
  + db_subnet_group_name     = "wordpress-bedrock-prod-db-subnet-group"
  + internet_gateway_id      = (known after apply)
  + phase2_summary           = (known after apply)
  + private_route_table_ids  = [
      + (known after apply),
      + (known after apply),
    ]
  + private_subnet_ids       = [
      + (known after apply),
      + (known after apply),
    ]
  + public_route_table_id    = (known after apply)
  + public_subnet_ids        = [
      + (known after apply),
      + (known after apply),
    ]
  + vpc_cidr                 = "10.0.0.0/16"
  + vpc_id                   = "vpc-023c8aac08314c0b6"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @takahiro1226, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Terraform Plan`*